Merge branch 'dev' into zeta-resume-from-checkpoint
